Repository: giellalt/corpus-sme
Catalog: prestable/tmx/eng/admin/depts/regjeringen.no/halddahusla-joihus_id_280.html.tmx
Source language: sme
Languages: eng

source: Hálddahuslaš jođihus - regjeringen.no
eng: Senior administrative staff - regjeringen.no

source: Departemeantaráđđi Jørn Krog
eng: Secretary General

source: E-poasta:
eng: E-mail:

source: Telefovdna:
eng: Telephone:

source: Ekspedišuvdnahoavda
eng: Directors General

source: Ekspedišuvdnahoavda – Mearraávkkástallan, mearrabiebmu ja márkan Magnor Nerheim
eng: Director General – Department of Aquaculture, Seafood and Markets

source: Mearraávkkástallan, mearrabiebmu ja márkan
eng: Department of Aquaculture, Seafood and Markets

source: Ekspedišuvdnahoavda – Davviguovlluid ja internašunála mariinna ovttasbargguid Kirsten Ullbæk Selvig
eng: Director General - Department of Arctic and International Maritime Affairs

source: Ekspedišuvdnahoavda – Dutkan- ja innovašuvdnaossodat Arne Benjaminsen
eng: Director General – Department of Research and Innovation

source: Dutkan- ja innovašuvdnaossodat
eng: Department of Research and Innovation

source: Doaibmi ekspedišuvdnahoavda – Áhperesursa- ja ridduossodat Johán H. Williams
eng: Director General - Department of Marine Resources and Coastal Management

source: Áhperesursa- ja ridduossodat
eng: Department of Marine Resources and Coastal Management
